# Pandas Serisi Oluşturmak

In [1]:
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5]) # numpy arraylerinden farkı indekslerle birlikte verilmesi

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
seri = pd.Series([1,2,3,4,5])

In [5]:
type(seri)

pandas.core.series.Series

In [7]:
seri.axes #Serinin indeks bilgilerini erişir

[RangeIndex(start=0, stop=5, step=1)]

In [10]:
seri.dtype

dtype('int64')

In [9]:
seri.size

5

In [11]:
seri.ndim

1

In [12]:
seri.values #numpy gibi vektör olarak erişmek istersem

array([1, 2, 3, 4, 5], dtype=int64)

In [13]:
seri.head(3) #serinin ilk 3 gözlemine erişmek için

0    1
1    2
2    3
dtype: int64

In [14]:
seri.tail(3) #serinin elemanlarına sondan bakmak istersek örn son 3 elaman

2    3
3    4
4    5
dtype: int64

In [15]:
#indeks isimlendirmesi

In [16]:
pd.Series([11,75,36,45,85])

0    11
1    75
2    36
3    45
4    85
dtype: int64

In [17]:
#indeks isimlendirmelerini kendim belirlemek istiyorum dersek

In [18]:
pd.Series([11,75,36,45,85], index = [1,3,5,7,9])

1    11
3    75
5    36
7    45
9    85
dtype: int64

In [19]:
#indeks isimlendirmesini int değil de string olarak vermek için

In [20]:
pd.Series([11,75,36,45,85], index = ["a","b","c","d","e"])

a    11
b    75
c    36
d    45
e    85
dtype: int64

In [21]:
seri = pd.Series([11,75,36,45,85], index = ["a","b","c","d","e"])

In [22]:
seri["a"]

11

In [23]:
seri["a":"c"]

a    11
b    75
c    36
dtype: int64

In [24]:
#Sozluk üzerinden liste olusturmak

In [25]:
sozluk = {"reg" : 10, "log": 11, "cart": 12}

In [26]:
seri = pd.Series(sozluk)

In [27]:
seri

reg     10
log     11
cart    12
dtype: int64

In [33]:
#iki seriyi birlestirerek seri olusturma

In [34]:
a = pd.Series([1,2,3])
b = pd.Series([4,5,6])

In [36]:
pd.concat([a,b])

0    1
1    2
2    3
0    4
1    5
2    6
dtype: int64

# Eleman İşlemleri

In [37]:
import numpy as np
a = np.array([1,2,53,486,54])
seri = pd.Series(a)
seri

0      1
1      2
2     53
3    486
4     54
dtype: int32

In [38]:
seri[0]

1

In [40]:
seri[0:3]

0     1
1     2
2    53
dtype: int32

In [41]:
seri = pd.Series([11,14,15,19], index = ["cey","bu","hüs","ar"])

In [42]:
seri

cey    11
bu     14
hüs    15
ar     19
dtype: int64

In [43]:
seri.index

Index(['cey', 'bu', 'hüs', 'ar'], dtype='object')

In [44]:
seri.keys

<bound method Series.keys of cey    11
bu     14
hüs    15
ar     19
dtype: int64>

In [49]:
list(seri.items()) # key-value şeklinde gelmesini istiyorsak

[('cey', 11), ('bu', 14), ('hüs', 15), ('ar', 19)]

In [50]:
tuple(seri.items())

(('cey', 11), ('bu', 14), ('hüs', 15), ('ar', 19))

In [51]:
seri.values

array([11, 14, 15, 19], dtype=int64)

In [52]:
#eleman sorgulama

In [54]:
"cey" in seri # serinin içinde mi?

True

In [55]:
"reg" in seri

False

In [56]:
#fancy eleman

In [59]:
seri[["cey", "bu"]]

cey    11
bu     14
dtype: int64

In [60]:
seri["hüs"] = 19

In [61]:
seri

cey    11
bu     14
hüs    19
ar     19
dtype: int64

In [62]:
#Slice ile fancy

In [65]:
seri["cey":"ar"]

cey    11
bu     14
hüs    19
ar     19
dtype: int64

# Pandas DataFrame Oluşturma

In [7]:
import pandas as pd

In [8]:
l = [11,75,46,635,63]

In [9]:
l

[11, 75, 46, 635, 63]

In [10]:
pd.DataFrame(l, columns = ["degisken_ismi"])

   degisken_ismi
0             11
1             75
2             46
3            635
4             63

In [11]:
import numpy as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [12]:
pd.DataFrame(m, columns = ["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [13]:
#df isimlendirme

In [14]:
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [15]:
df.columns # degisken isimlerini getirir

Index(['var1', 'var2', 'var3'], dtype='object')

In [16]:
df.columns = ("deg1","deg2","deg3")

In [17]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [18]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [19]:
df.ndim

2

In [20]:
df.size

9

In [21]:
df.shape

(3, 3)

In [22]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [23]:
type(df.values)

numpy.ndarray

In [24]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [25]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

In [26]:
a = np.array([1,2,3,4,5])
a

array([1, 2, 3, 4, 5])

In [27]:
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

In [28]:
b = pd.Series([1,2,3,4,5,6])
b

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [29]:
pd.DataFrame(b, columns = ["degisken"])

   degisken
0         1
1         2
2         3
3         4
4         5
5         6

# DataFrame Eleman Islemleri

In [30]:
import numpy as np
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [31]:
pd.DataFrame(s1, columns = ["s1"])

   s1
0   5
1   0
2   7
3   9
4   1

In [32]:
sozluk = {"var1": s1, "var2": s2, "var3":s3} #Sozluk üzerinden df oluşturma

In [33]:
sozluk

{'var1': array([5, 0, 7, 9, 1]),
 'var2': array([4, 4, 3, 5, 3]),
 'var3': array([4, 8, 8, 0, 0])}

In [48]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     5     4     4
1     0     4     8
2     7     3     8
3     9     5     0
4     1     3     0

In [49]:
df[0:1]

   var1  var2  var3
0     5     4     4

In [50]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [51]:
df.index = ["a","b","c","d","e"]

In [52]:
df

   var1  var2  var3
a     5     4     4
b     0     4     8
c     7     3     8
d     9     5     0
e     1     3     0

In [53]:
df["c":"e"]

   var1  var2  var3
c     7     3     8
d     9     5     0
e     1     3     0

In [54]:
#Silme

In [55]:
df.drop("a", axis = 0) # axis 0 yapıyoruz ki satırı almak istediğimiz bilgisini pandasa vermiş olalım

   var1  var2  var3
b     0     4     8
c     7     3     8
d     9     5     0
e     1     3     0

In [56]:
df

   var1  var2  var3
a     5     4     4
b     0     4     8
c     7     3     8
d     9     5     0
e     1     3     0

In [57]:
df.drop("a", axis = 0, inplace = True) # inplace: df üzerinden yapılan işlemin kalıcı olmasını sağlar

In [58]:
df

   var1  var2  var3
b     0     4     8
c     7     3     8
d     9     5     0
e     1     3     0

In [59]:
#fancy ile silme ("c" ve "e" satırını)

In [60]:
l = ["c","e"]

In [61]:
df.drop(l, axis = 0)

   var1  var2  var3
b     0     4     8
d     9     5     0

In [62]:
df

   var1  var2  var3
b     0     4     8
c     7     3     8
d     9     5     0
e     1     3     0

In [63]:
#degiskenler için

In [64]:
"var1" in df

True

In [65]:
l = ["var1", "var4", "var2"]

In [66]:
for i in l:
    print(i in df)

True
False
True

In [67]:
df

   var1  var2  var3
b     0     4     8
c     7     3     8
d     9     5     0
e     1     3     0

In [74]:
df["var1"]

b    0
c    7
d    9
e    1
Name: var1, dtype: int32

In [73]:
df["var4"] = df["var1"] * df["var2"]

In [75]:
df

   var1  var2  var3  var4
b     0     4     8     0
c     7     3     8    21
d     9     5     0    45
e     1     3     0     3

In [76]:
#degisken silme

In [77]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     0     4     8
c     7     3     8
d     9     5     0
e     1     3     0

In [78]:
df

   var1  var2  var3  var4
b     0     4     8     0
c     7     3     8    21
d     9     5     0    45
e     1     3     0     3

In [79]:
df.drop("var4", axis = 1, inplace = True)

In [80]:
df

   var1  var2  var3
b     0     4     8
c     7     3     8
d     9     5     0
e     1     3     0

In [81]:
# fancy ile silme

In [82]:
l = ["var1","var2"]

In [83]:
df.drop(l, axis = 1)

   var3
b     8
c     8
d     0
e     0

# Gözlem ve Değişken Seçimi: loc & iloc

In [2]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    20    21     2
1    15    15    13
2    21     4    16
3    26    29    10
4    10     3     7
5     1    25    28
6    16    23     4
7     2    27    18
8    18    27    10
9     9    17    12

In [3]:
#loc: tanımlandığı şekliyle seçim yapmak için kullanılır.

In [4]:
df.loc[0:3]

   var1  var2  var3
0    20    21     2
1    15    15    13
2    21     4    16
3    26    29    10

In [5]:
#iloc: alışık olduğumuz indeksleme mantığıyla seçim yapar.

In [6]:
df.iloc[0:3]

   var1  var2  var3
0    20    21     2
1    15    15    13
2    21     4    16

In [7]:
df.iloc[:3,:2]

   var1  var2
0    20    21
1    15    15
2    21     4

In [8]:
df.loc[0:3, "var3"]

0     2
1    13
2    16
3    10
Name: var3, dtype: int32

In [11]:
#eğer değişken ya da gözlem birimleri yani satırlarla ilgili mutlak
#bir değer işaretlemesi yapacaksak "loc" kullanmamız gerekiyor.

#eğer ben bunlara takılmıyorum alışık olduğum bi indeksli seçim yaklaşımım
#var dersek "iloc" kullanıcaz.

#özetle eğer verilen kurallara göre seçim yapılma işlemi varsa gözlem ya da
#değisken isimlendirmeleri açısından "loc" yapısı kullanır.
#eğer verilen isimlendirmelerden bağımsız ben bunlara takılmıyorum klasik
#index mantığıyla seçim yapmak istiyorum dersek de "iloc" kullanılır

In [10]:
df.iloc[0:,]["var3"]

0     2
1    13
2    16
3    10
4     7
5    28
6     4
7    18
8    10
9    12
Name: var3, dtype: int32

In [12]:
df

   var1  var2  var3
0    20    21     2
1    15    15    13
2    21     4    16
3    26    29    10
4    10     3     7
5     1    25    28
6    16    23     4
7     2    27    18
8    18    27    10
9     9    17    12

In [13]:
df["var1"]

0    20
1    15
2    21
3    26
4    10
5     1
6    16
7     2
8    18
9     9
Name: var1, dtype: int32

In [16]:
df[0:2] [["var1","var2"]]

   var1  var2
0    20    21
1    15    15

In [19]:
df[df.var1 > 15]["var1"]

0    20
2    21
3    26
6    16
8    18
Name: var1, dtype: int32

In [32]:
df[(df.var1>15) & (df.var2<1)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [37]:
df.loc[(df.var1>15), ["var1","var2"]]

   var1  var2
0    20    21
2    21     4
3    26    29
6    16    23
8    18    27

In [41]:
df[(df.var1>15)] [["var1","var2"]] #loc kullanmadak yapmak istersek

   var1  var2
0    20    21
2    21     4
3    26    29
6    16    23
8    18    27

# Birleştirme (Join) İşlemleri

In [2]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    19    26     2
1    29    23    16
2    12    29    20
3     2    25    15
4    19    19    11

In [3]:
df2 = df1 + 99

In [4]:
df2

   var1  var2  var3
0   118   125   101
1   128   122   115
2   111   128   119
3   101   124   114
4   118   118   110

In [5]:
pd.concat([df1,df2])

   var1  var2  var3
0    19    26     2
1    29    23    16
2    12    29    20
3     2    25    15
4    19    19    11
0   118   125   101
1   128   122   115
2   111   128   119
3   101   124   114
4   118   118   110

In [6]:
pd.concat([df1, df2], ignore_index = True)

   var1  var2  var3
0    19    26     2
1    29    23    16
2    12    29    20
3     2    25    15
4    19    19    11
5   118   125   101
6   128   122   115
7   111   128   119
8   101   124   114
9   118   118   110

In [7]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [8]:
df2.columns = ["var1","var2","deg3"]

In [9]:
df2.columns

Index(['var1', 'var2', 'deg3'], dtype='object')

In [10]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0    19    26   2.0    NaN
1    29    23  16.0    NaN
2    12    29  20.0    NaN
3     2    25  15.0    NaN
4    19    19  11.0    NaN
0   118   125   NaN  101.0
1   128   122   NaN  115.0
2   111   128   NaN  119.0
3   101   124   NaN  114.0
4   118   118   NaN  110.0

In [11]:
pd.concat([df1,df2], join = "inner") #kesisimlerini getirdi

   var1  var2
0    19    26
1    29    23
2    12    29
3     2    25
4    19    19
0   118   125
1   128   122
2   111   128
3   101   124
4   118   118

In [21]:
pd.concat([df1, df2], join_axes = [df2.columns], ignore_index: True)

SyntaxError: positional argument follows keyword argument (267727474.py, line 1)

# İleri Birleştirme İşlemleri

In [22]:
import pandas as pd

In [23]:
#birebir birleştirme

In [45]:
df1 = pd.DataFrame({'calisanlar': ['Ceyda','Bugra','Huseyin','Can'],
                   'grup':['Muhasebe','Muhendislik','Muhendislik','İK']})
df1

  calisanlar         grup
0      Ceyda     Muhasebe
1      Bugra  Muhendislik
2    Huseyin  Muhendislik
3        Can           İK

In [46]:
df2 = pd.DataFrame({'calisanlar': ['Ceyda','Bugra','Huseyin','Can'],
                   'ilk_giris': [2010,2009,2014,2019]})
df2

  calisanlar  ilk_giris
0      Ceyda       2010
1      Bugra       2009
2    Huseyin       2014
3        Can       2019

In [47]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0      Ceyda     Muhasebe       2010
1      Bugra  Muhendislik       2009
2    Huseyin  Muhendislik       2014
3        Can           İK       2019

In [48]:
pd.merge(df1, df2, on = 'calisanlar')

  calisanlar         grup  ilk_giris
0      Ceyda     Muhasebe       2010
1      Bugra  Muhendislik       2009
2    Huseyin  Muhendislik       2014
3        Can           İK       2019

In [49]:
#çoktan teke

In [50]:
df3 = pd.merge(df1, df2)
df3

  calisanlar         grup  ilk_giris
0      Ceyda     Muhasebe       2010
1      Bugra  Muhendislik       2009
2    Huseyin  Muhendislik       2014
3        Can           İK       2019

In [51]:
df4 = pd.DataFrame({'grup':['Mühendislik','Tıp','İK'],
                   'mudur': ['Ceyda','Bugra','Huseyin']})
df4

          grup    mudur
0  Mühendislik    Ceyda
1          Tıp    Bugra
2           İK  Huseyin

In [52]:
pd.merge(df3, df4)

  calisanlar grup  ilk_giris    mudur
0        Can   İK       2019  Huseyin

In [53]:
#çoktan çoka

In [54]:
df5 = pd.DataFrame({'grup': ['Muhasebe','Muhasebe','Muhendislik','IK','İK','Muhendislik'],
                   'yetenekler': ['matematik','excel','kodlama','excel','yönetim','linux']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3           IK      excel
4           İK    yönetim
5  Muhendislik      linux

In [55]:
df1

  calisanlar         grup
0      Ceyda     Muhasebe
1      Bugra  Muhendislik
2    Huseyin  Muhendislik
3        Can           İK

In [56]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0      Ceyda     Muhasebe  matematik
1      Ceyda     Muhasebe      excel
2      Bugra  Muhendislik    kodlama
3      Bugra  Muhendislik      linux
4    Huseyin  Muhendislik    kodlama
5    Huseyin  Muhendislik      linux
6        Can           İK    yönetim

# **Toplulaştırma ve Gruplama (Aggregation & Grouping)**

**Basit toplulaştırma fonksiyonlar:**

*count()

*first()

*last()

*mean()

*median()

*min()

*max()

*std()

*var()

*sum()

In [57]:
import seaborn as sns

In [59]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [60]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [61]:
df.shape

(1035, 6)

In [62]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [64]:
df["mass"].mean()

2.6381605847953233

In [65]:
df["mass"].count()

513

In [67]:
df["mass"].max()

25.0

In [68]:
df["mass"].min()

0.0036

In [69]:
df["mass"].std()

3.8186166509616046

In [70]:
df["mass"].sum()

1353.37638

In [71]:
df["mass"].var()

14.58183312700122

In [ ]:
#describe: tek tek ele almak yerine bir arada hepsini görmek istiyorsak

In [72]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [73]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [75]:
#dropna(): eksik değerleri ele almadan hesapla

#T: Transpozunu al demek

In [76]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# **Gruplama İşlemleri**

In [79]:
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'veri': ['11','17','23','55','43','77']},columns = ['gruplar','veri'])
df

  gruplar veri
0       A   11
1       B   17
2       C   23
3       A   55
4       B   43
5       C   77

In [80]:
df.groupby("gruplar")

In [81]:
df.groupby("gruplar").mean()

           veri
gruplar
A         577.5
B         871.5
C        1188.5

In [82]:
df.groupby("gruplar").sum()

         veri
gruplar
A        1155
B        1743
C        2377

In [83]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [84]:
df.groupby("method")

In [86]:
df.groupby("method")["orbital_period"].sum()

method
Astrometry                       1.262360e+03
Eclipse Timing Variations        4.276480e+04
Imaging                          1.418973e+06
Microlensing                     2.207500e+04
Orbital Brightness Modulation    2.127920e+00
Pulsar Timing                    3.671511e+04
Pulsation Timing Variations      1.170000e+03
Radial Velocity                  4.553151e+05
Transit                          8.377523e+03
Transit Timing Variations        2.393505e+02
Name: orbital_period, dtype: float64

In [87]:
df.groupby("method")["mass"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Eclipse Timing Variations,2.0,5.125000,1.308148,4.2000,4.66250,5.125,5.5875,6.05
Imaging,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Microlensing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Orbital Brightness Modulation,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsar Timing,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,510.0,2.630699,3.825883,0.0036,0.22525,1.260,3.0000,25.00
Transit,1.0,1.470000,NaN,1.4700,1.47000,1.470,1.4700,1.47
Transit Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# **İleri Toplulaştırma İşlemleri (Aggregate, filter, transform, apply)**

In [90]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [91]:
#aggregate

In [92]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      234.0
B             17.0      456.0
C             66.0      612.5

In [94]:
df.groupby("gruplar").aggregate([min, np.median,max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  234.0  368
B              11   17.0  23       456  456.0  456
C              33   66.0  99       369  612.5  856

In [95]:
df.groupby("gruplar").aggregate({"degisken1": "min", "degisken2" : "max"})

         degisken1  degisken2
gruplar
A               10        368
B               11        456
C               33        856

In [96]:
#filter

In [106]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [107]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [109]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  189.504617
B         8.485281    0.000000
C        46.669048  344.361002

In [108]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        856
5       C         99        369

In [3]:
#transform

In [4]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [4]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [4]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [4]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [4]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [4]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [5]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [7]:
df_a = df.iloc[:, 1:3]

In [10]:
df_a.transform(lambda x: x-x.mean() /x.std()) #lambda: bir fonk isimlendirmesi yapmadan fonk oluşturmaya yarar

   degisken1   degisken2
0   9.013055   98.225121
1  22.013055  454.225121
2  32.013055  854.225121
3  21.013055  366.225121
4  10.013055  454.225121
5  98.013055  367.225121

In [14]:
#apply

tıpkı transform fonk ve filter fonk gibi dataframein değişkenlerin üzerinde gezinme yeteneği olan ve toplulaştırma amacıyla kullanılabilcek fonksiyondur.

In [16]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['degisken1','degisken2'])
df

   degisken1  degisken2
0         10        100
1         23        456
2         33        856
3         22        368
4         11        456
5         99        369

In [17]:
df.apply(np.sum)

degisken1     198
degisken2    2605
dtype: int64

In [18]:
df.apply(np.sum)

degisken1     198
degisken2    2605
dtype: int64

In [19]:
df.apply(np.mean)

degisken1     33.000000
degisken2    434.166667
dtype: float64

In [20]:
#aynı işlemi grup bazında yapsaydık nasıl olurdu

In [21]:
import pandas as pd
df = pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
                  'degisken1': [10,23,33,22,11,99],
                  'degisken2': [100,456,856,368,456,369]},
                 columns = ['gruplar','degisken1','degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        456
2       C         33        856
3       A         22        368
4       B         11        456
5       C         99        369

In [22]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        468
B            BB         34        912
C            CC        132       1225

In [33]:
df.groupby("gruplar").apply(np.mean)

C:\Users\ceyda\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
C:\Users\ceyda\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:3438: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

         degisken1  degisken2
gruplar
A             16.0      234.0
B             17.0      456.0
C             66.0      612.5

# **Pivot Tablolar**

In [ ]:
#groupby'ın çok boyutlu versiyonu olarak düşünülebilir

In [34]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [36]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [ ]:
#unstack(): hiyerarşik index yapısını çözmek için kullanılır

In [39]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [42]:
#unstack() kullanmadan elde edilen çıktı

In [43]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [44]:
#pivot ile table

In [45]:
titanic.pivot_table("survived", index = "sex", columns = "class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [47]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [49]:
age = pd.cut(titanic["age"], [0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [50]:
titanic.pivot_table("survived", ["sex", age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

# **Dış Kaynaklı Veri Okumak**

In [51]:
import pandas as pd

In [59]:
?pd.read_csv

Signature:
pd.read_csv(
    filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]',
    sep=<no_default>,
    delimiter=None,
    header='infer',
    names=<no_default>,
    index_col=None,
    usecols=None,
    squeeze=None,
    prefix=<no_default>,
    mangle_dupe_cols=True,
    dtype: 'DtypeArg | None' = None,
    engine: 'CSVEngine | None' = None,
    converters=None,
    true_values=None,
    false_values=None,
    skipinitialspace=False,
    skiprows=None,
    skipfooter=0,
    nrows=None,
    na_values=None,
    keep_default_na=True,
    na_filter=True,
    verbose=False,
    skip_blank_lines=True,
    parse_dates=None,
    infer_datetime_format=False,
    keep_date_col=False,
    date_parser=None,
    dayfirst=False,
    cache_dates=True,
    iterator=False,
    chunksize=None,
    compression: 'CompressionOptions' = 'infer',
    thousands=None,
    decimal: 'str' = '.',
    lineterminator=None,
    quotechar='"',
    quoting=0,
    doublequote=True,
    escapechar=None,
    comment=None,
    encoding=None,
    encoding_errors: 'str | None' = 'strict',
    dialect=None,
    error_bad_lines=None,
    warn_bad_lines=None,
    on_bad_lines=None,
    delim_whitespace=False,
    low_memory=True,
    memory_map=False,
    float_precision=None,
    storage_options: 'StorageOptions' = None,
)
Docstring:
Read a comma-separated values (csv) file into DataFrame.

Also supports optionally iterating or breaking of the file
into chunks.

Additional help can be found in the online docs for
`IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

Parameters
----------
filepath_or_buffer : str, path object or file-like object
    Any valid string path is acceptable. The string could be a URL. Valid
    URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
    expected. A local file could be: file://localhost/path/to/table.csv.

    If you want to pass in a path object, pandas accepts any ``os.PathLike``.

    By file-like object, we refer to objects with a ``read()`` method, such as
    a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
sep : str, default ','
    Delimiter to use. If sep is None, the C engine cannot automatically detect
    the separator, but the Python parsing engine can, meaning the latter will
    be used and automatically detect the separator by Python's builtin sniffer
    tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
    different from ``'\s+'`` will be interpreted as regular expressions and
    will also force the use of the Python parsing engine. Note that regex
    delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
delimiter : str, default ``None``
    Alias for sep.
header : int, list of int, None, default 'infer'
    Row number(s) to use as the column names, and the start of the
    data.  Default behavior is to infer the column names: if no names
    are passed the behavior is identical to ``header=0`` and column
    names are inferred from the first line of the file, if column
    names are passed explicitly then the behavior is identical to
    ``header=None``. Explicitly pass ``header=0`` to be able to
    replace existing names. The header can be a list of integers that
    specify row locations for a multi-index on the columns
    e.g. [0,1,3]. Intervening rows that are not specified will be
    skipped (e.g. 2 in this example is skipped). Note that this
    parameter ignores commented lines and empty lines if
    ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
    data rather than the first line of the file.
names : array-like, optional
    List of column names to use. If the file contains a header row,
    then you should explicitly pass ``header=0`` to override the column names.
    Duplicates in this list are not allowed.
index_col : int, str, sequence of int / str, or False, optional, default ``None``
  Column(s) to use as the row labels of the ``DataFrame``, either given as
  string name or column index. If a sequence of int / str is given, a
  MultiIndex is used.

  Note: ``index_col=False`` can be used to force pandas to *not* use the first
  column as the index, e.g. when you have a malformed file with delimiters at
  the end of each line.
usecols : list-like or callable, optional
    Return a subset of the columns. If list-like, all elements must either
    be positional (i.e. integer indices into the document columns) or strings
    that correspond to column names provided either by the user in `names` or
    inferred from the document header row(s). If ``names`` are given, the document
    header row(s) are not taken into account. For example, a valid list-like
    `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
    Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
    To instantiate a DataFrame from ``data`` with element order preserved use
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
    in ``['foo', 'bar']`` order or
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
    for ``['bar', 'foo']`` order.

    If callable, the callable function will be evaluated against the column
    names, returning names where the callable function evaluates to True. An
    example of a valid callable argument would be ``lambda x: x.upper() in
    ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
    parsing time and lower memory usage.
squeeze : bool, default False
    If the parsed data only contains one column then return a Series.

    .. deprecated:: 1.4.0
        Append ``.squeeze("columns")`` to the call to ``read_csv`` to squeeze
        the data.
prefix : str, optional
    Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...

    .. deprecated:: 1.4.0
       Use a list comprehension on the DataFrame's columns after calling ``read_csv``.
mangle_dupe_cols : bool, default True
    Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
    'X'...'X'. Passing in False will cause data to be overwritten if there
    are duplicate names in the columns.
dtype : Type name or dict of column -> type, optional
    Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
    'c': 'Int64'}
    Use `str` or `object` together with suitable `na_values` settings
    to preserve and not interpret dtype.
    If converters are specified, they will be applied INSTEAD
    of dtype conversion.
engine : {'c', 'python', 'pyarrow'}, optional
    Parser engine to use. The C and pyarrow engines are faster, while the python engine
    is currently more feature-complete. Multithreading is currently only supported by
    the pyarrow engine.

    .. versionadded:: 1.4.0

        The "pyarrow" engine was added as an *experimental* engine, and some features
        are unsupported, or may not work correctly, with this engine.
converters : dict, optional
    Dict of functions for converting values in certain columns. Keys can either
    be integers or column labels.
true_values : list, optional
    Values to consider as True.
false_values : list, optional
    Values to consider as False.
skipinitialspace : bool, default False
    Skip spaces after delimiter.
skiprows : list-like, int or callable, optional
    Line numbers to skip (0-indexed) or number of lines to skip (int)
    at the start of the file.

    If callable, the callable function will be evaluated against the row
    indices, returning True if the row should be skipped and False otherwise.
    An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
skipfooter : int, default 0
    Number of lines at bottom of file to skip (Unsupported with engine='c').
nrows : int, optional
    Number of rows of file to read. Useful for reading pieces of large files.
na_values : scalar, str, list-like, or dict, optional
    Additional strings to recognize as NA/NaN. If dict passed, specific
    per-column NA values.  By default the following values are interpreted as
    NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
    '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
    'nan', 'null'.
keep_default_na : bool, default True
    Whether or not to include the default NaN values when parsing the data.
    Depending on whether `na_values` is passed in, the behavior is as follows:

    * If `keep_default_na` is True, and `na_values` are specified, `na_values`
      is appended to the default NaN values used for parsing.
    * If `keep_default_na` is True, and `na_values` are not specified, only
      the default NaN values are used for parsing.
    * If `keep_default_na` is False, and `na_values` are specified, only
      the NaN values specified `na_values` are used for parsing.
    * If `keep_default_na` is False, and `na_values` are not specified, no
      strings will be parsed as NaN.

    Note that if `na_filter` is passed in as False, the `keep_default_na` and
    `na_values` parameters will be ignored.
na_filter : bool, default True
    Detect missing value markers (empty strings and the value of na_values). In
    data without any NAs, passing na_filter=False can improve the performance
    of reading a large file.
verbose : bool, default False
    Indicate number of NA values placed in non-numeric columns.
skip_blank_lines : bool, default True
    If True, skip over blank lines rather than interpreting as NaN values.
parse_dates : bool or list of int or names or list of lists or dict, default False
    The behavior is as follows:

    * boolean. If True -> try parsing the index.
    * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
      each as a separate date column.
    * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
      a single date column.
    * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
      result 'foo'

    If a column or index cannot be represented as an array of datetimes,
    say because of an unparsable value or a mixture of timezones, the column
    or index will be returned unaltered as an object data type. For
    non-standard datetime parsing, use ``pd.to_datetime`` after
    ``pd.read_csv``. To parse an index or column with a mixture of timezones,
    specify ``date_parser`` to be a partially-applied
    :func:`pandas.to_datetime` with ``utc=True``. See
    :ref:`io.csv.mixed_timezones` for more.

    Note: A fast-path exists for iso8601-formatted dates.
infer_datetime_format : bool, default False
    If True and `parse_dates` is enabled, pandas will attempt to infer the
    format of the datetime strings in the columns, and if it can be inferred,
    switch to a faster method of parsing them. In some cases this can increase
    the parsing speed by 5-10x.
keep_date_col : bool, default False
    If True and `parse_dates` specifies combining multiple columns then
    keep the original columns.
date_parser : function, optional
    Function to use for converting a sequence of string columns to an array of
    datetime instances. The default uses ``dateutil.parser.parser`` to do the
    conversion. Pandas will try to call `date_parser` in three different ways,
    advancing to the next if an exception occurs: 1) Pass one or more arrays
    (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
    string values from the columns defined by `parse_dates` into a single array
    and pass that; and 3) call `date_parser` once for each row using one or
    more strings (corresponding to the columns defined by `parse_dates`) as
    arguments.
dayfirst : bool, default False
    DD/MM format dates, international and European format.
cache_dates : bool, default True
    If True, use a cache of unique, converted dates to apply the datetime
    conversion. May produce significant speed-up when parsing duplicate
    date strings, especially ones with timezone offsets.

    .. versionadded:: 0.25.0
iterator : bool, default False
    Return TextFileReader object for iteration or getting chunks with
    ``get_chunk()``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
chunksize : int, optional
    Return TextFileReader object for iteration.
    See the `IO Tools docs
    <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
    for more information on ``iterator`` and ``chunksize``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
compression : str or dict, default 'infer'
    For on-the-fly decompression of on-disk data. If 'infer' and '%s' is
    path-like, then detect compression from the following extensions: '.gz',
    '.bz2', '.zip', '.xz', or '.zst' (otherwise no compression). If using
    'zip', the ZIP file must contain only one data file to be read in. Set to
    ``None`` for no decompression. Can also be a dict with key ``'method'`` set
    to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``} and other
    key-value pairs are forwarded to ``zipfile.ZipFile``, ``gzip.GzipFile``,
    ``bz2.BZ2File``, or ``zstandard.ZstdDecompressor``, respectively. As an
    example, the following could be passed for Zstandard decompression using a
    custom compression dictionary:
    ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

    .. versionchanged:: 1.4.0 Zstandard support.

thousands : str, optional
    Thousands separator.
decimal : str, default '.'
    Character to recognize as decimal point (e.g. use ',' for European data).
lineterminator : str (length 1), optional
    Character to break file into lines. Only valid with C parser.
quotechar : str (length 1), optional
    The character used to denote the start and end of a quoted item. Quoted
    items can include the delimiter and it will be ignored.
quoting : int or csv.QUOTE_* instance, default 0
    Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
    QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
doublequote : bool, default ``True``
   When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
   whether or not to interpret two consecutive quotechar elements INSIDE a
   field as a single ``quotechar`` element.
escapechar : str (length 1), optional
    One-character string used to escape other characters.
comment : str, optional
    Indicates remainder of line should not be parsed. If found at the beginning
    of a line, the line will be ignored altogether. This parameter must be a
    single character. Like empty lines (as long as ``skip_blank_lines=True``),
    fully commented lines are ignored by the parameter `header` but not by
    `skiprows`. For example, if ``comment='#'``, parsing
    ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
    treated as the header.
encoding : str, optional
    Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
    standard encodings
    <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

    .. versionchanged:: 1.2

       When ``encoding`` is ``None``, ``errors="replace"`` is passed to
       ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
       This behavior was previously only the case for ``engine="python"``.

    .. versionchanged:: 1.3.0

       ``encoding_errors`` is a new argument. ``encoding`` has no longer an
       influence on how encoding errors are handled.

encoding_errors : str, optional, default "strict"
    How encoding errors are treated. `List of possible values
    <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

    .. versionadded:: 1.3.0

dialect : str or csv.Dialect, optional
    If provided, this parameter will override values (default or not) for the
    following parameters: `delimiter`, `doublequote`, `escapechar`,
    `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
    override values, a ParserWarning will be issued. See csv.Dialect
    documentation for more details.
error_bad_lines : bool, optional, default ``None``
    Lines with too many fields (e.g. a csv line with too many commas) will by
    default cause an exception to be raised, and no DataFrame will be returned.
    If False, then these "bad lines" will be dropped from the DataFrame that is
    returned.

    .. deprecated:: 1.3.0
       The ``on_bad_lines`` parameter should be used instead to specify behavior upon
       encountering a bad line instead.
warn_bad_lines : bool, optional, default ``None``
    If error_bad_lines is False, and warn_bad_lines is True, a warning for each
    "bad line" will be output.

    .. deprecated:: 1.3.0
       The ``on_bad_lines`` parameter should be used instead to specify behavior upon
       encountering a bad line instead.
on_bad_lines : {'error', 'warn', 'skip'} or callable, default 'error'
    Specifies what to do upon encountering a bad line (a line with too many fields).
    Allowed values are :

        - 'error', raise an Exception when a bad line is encountered.
        - 'warn', raise a warning when a bad line is encountered and skip that line.
        - 'skip', skip bad lines without raising or warning when they are encountered.

    .. versionadded:: 1.3.0

        - callable, function with signature
          ``(bad_line: list[str]) -> list[str] | None`` that will process a single
          bad line. ``bad_line`` is a list of strings split by the ``sep``.
          If the function returns ``None``, the bad line will be ignored.
          If the function returns a new list of strings with more elements than
          expected, a ``ParserWarning`` will be emitted while dropping extra elements.
          Only supported when ``engine="python"``

    .. versionadded:: 1.4.0

delim_whitespace : bool, default False
    Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
    used as the sep. Equivalent to setting ``sep='\s+'``. If this option
    is set to True, nothing should be passed in for the ``delimiter``
    parameter.
low_memory : bool, default True
    Internally process the file in chunks, resulting in lower memory use
    while parsing, but possibly mixed type inference.  To ensure no mixed
    types either set False, or specify the type with the `dtype` parameter.
    Note that the entire file is read into a single DataFrame regardless,
    use the `chunksize` or `iterator` parameter to return the data in chunks.
    (Only valid with C parser).
memory_map : bool, default False
    If a filepath is provided for `filepath_or_buffer`, map the file object
    directly onto memory and access the data directly from there. Using this
    option can improve performance because there is no longer any I/O overhead.
float_precision : str, optional
    Specifies which converter the C engine should use for floating-point
    values. The options are ``None`` or 'high' for the ordinary converter,
    'legacy' for the original lower precision pandas converter, and
    'round_trip' for the round-trip converter.

    .. versionchanged:: 1.2

storage_options : dict, optional
    Extra options that make sense for a particular storage connection, e.g.
    host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
    are forwarded to ``urllib`` as header options. For other URLs (e.g.
    starting with "s3://", and "gcs://") the key-value pairs are forwarded to
    ``fsspec``. Please see ``fsspec`` and ``urllib`` for more details.

    .. versionadded:: 1.2

Returns
-------
DataFrame or TextParser
    A comma-separated values (csv) file is returned as two-dimensional
    data structure with labeled axes.

See Also
--------
DataFrame.to_csv : Write DataFrame to a comma-separated values (csv) file.
read_csv : Read a comma-separated values (csv) file into DataFrame.
read_fwf : Read a table of fixed-width formatted lines into DataFrame.

Examples
--------

In [54]:
#csv okuma
pd.read_csv("ornekcsv.csv", sep = ";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [57]:
#txt okuma
pd.read_csv("duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [61]:
#excel
pd.read_excel("ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [62]:
df = pd.read_excel("ornekx.xlsx")

In [63]:
type(df)

pandas.core.frame.DataFrame

In [64]:
df.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [66]:
df.columns = ("A","B","C")
df

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0